aging = [0.0970, 0.1010, 0.1050, 0.1080, 0.1140, 0.1190, 0.1260, 0.1350, 0.1420, 0.1490];
rev = [22680.4, 25309.7, 29340.9, 35057.5, 43309.6, 51167.6, 52918.8, 44375.7, 60454.7, 63324.0];
exp = [18470.4, 21754.7, 25812.7, 31853.8, 38051.5, 44644.9, 49228, 51301.4, 56481.5, 59035];
bal = [28269.2, 31800, 35344.8, 38580, 43884.6, 50901.3, 54623.3, 48316.6, 52573.6, 69851];
% 绘制散点图
figure
subplot(3,1,1)
plot(aging, rev, 'bo')
xlabel('65岁及以上人口比例（老龄化率）（%）')
ylabel('城镇职工基本养老保险基金收入(亿元)')
subplot(3,1,2)
plot(aging, exp, 'rd')
xlabel('65岁及以上人口比例（老龄化率）（%）')
ylabel('城镇职工基本养老保险基金支出(亿元)')
subplot(3,1,3)
plot(aging, bal, 'go')
xlabel('65岁及以上人口比例（老龄化率）（%）')
ylabel('城镇职工基本养老保险累计结余(亿元)')
%计算皮尔逊相关系数
[r1, p1] = corr(aging', rev')
[r2, p2] = corr(aging', exp')
[r3, p3] = corr(aging', bal')